// bonusTask3_10.11.20.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>
using namespace std;
int main()
{
    /*
    Трайчо иска да си купи кола, но има някои изисквания. Той е склонен да я вземе нова или втора ръка.
    Ако е втора ръка, иска, ако има климатик да е на по-малко от 115 000 км., да е поне 70 конски сили 
    и да струва най-много 6 000 лева, а ако няма климатик да е на по-малко от 180 000 км., да е поне 60 
    конски сили и да струва най-много 2 000 лева. Ако е нова иска да е от 70 до 90 конски сили включително
    и да струва не повече от 25 000 лева.
    Напишете булев израз, който по дадена информация за това дали колата е стара или нова,
    има ли климатик, мощността, пробегът и цената й, пресмята дали Трайчо е склонен да си купи колата.
    Примери:
        Колата е стара, има климатик, мощността й е 70 конски сили, пробегът й е 100 000 км. и цената й е 5 000 лв.
        Трайчо би си я купил, тъй като мощността й е поне 70 конски сили, пробегът й е по-малък от 115 000 км. и цената й е под 6 000 лева.
        Колата е стара, няма климатик, мощността й е 80 конски сили, пробегът й е 200 000 км. и цената й е 5 000 лв.
        Трайчо не би си я купил, понеже колата не е с пробег по-малък от 180 000 км. и цената не е по-малка от 2 000 лв.*/
    cout << "Enter parameters [is old] [has AC] [horse power] [mileage] [price]: ";
    bool isOld, hasAC;
    int horsePower, mileage;
    double price;
    cin >> isOld >> hasAC >> horsePower >> mileage >> price;
    bool willBuy = (isOld == true && hasAC == true && mileage < 115000 && horsePower >= 70 && price <= 6000) ||
        (isOld == true && hasAC == false && mileage < 180000 && horsePower >= 60 && price <= 2000) ||
        (isOld == false && horsePower >= 70 && horsePower <= 90 && price <= 25000);
    cout << willBuy << endl;
}

